[
  {
    "quote": "Three Trees Center for Change is the publisher of the excellent Stop Drop Think series of cognitive-behavioral workbooks. I have used these workbooks to help guide my clients through the change process. The workbooks are client-centered and written in non-judgmental, accessible language. I recommend this program to anyone concerned about substance abuse and antisocial thinking.",
    "name": "Chris Wig",
    "title": ""
  },
  {
    "quote": "Three Trees has been very innovative in their approach with treatment utilizing books as well as classroom options. I worked very closely with them during my time with the state probation office. Their staff is knowledgeable, the treatment has been statistically proven to be effective and they provide excellent communication with the referring agencies. We are fortunate to have them in York County.",
    "name": "Margarette Parrish",
    "title": "(Former) State Probation Office"
  },
  {
    "quote": "I have known Ben and Jamesa Motley and their work at Three Trees (and elsewhere) for a good number of years. The innovative treatment methods, with a strong core of mindfulness training, developed and practiced at Three Trees, has been clearly demonstrated (via recidivism rates in areas of domestic violence, sexual offenses, and substance abuse legal issues over a period of years) to be greatly effective. If you are a professional seeking greater understanding and training in these areas, an agency seeking to better serve clients with these problems, or an individual seeking help. there is no better place to go.",
    "name": "Ken Lenington, MD",
    "title": "Certification in General Psychiatry and Addiction Medicine"
  },
  {
    "quote": "Three Trees Center for Change has been incredible to partner with! Especially as we worked to deliver our students options that meet their needs in a virtual environment. The staff is very responsive and willing to collaborate to ensure all of our requests are met and the programs meet our needs. The Responsible Relationships on Campus course has been well received by our students. Amne and the rest of the team are quick to let us know about completion or any issues that arise. We love working with Three Threes!",
    "name": "University of South Carolina",
    "title": ""
  },
  {
    "quote": "You will not find a more knowledgeable counseling service. Ben and his staff have the care, compassion and concern for each and every client, at all times. I was a career prosecutor and would see the results day in and day out on parents and their teenagers when they had been counseled by Ben and his staff. The turnaround was remarkable. I, as a parent, would learn much about parenting while listening along to group sessions. I would not hesitate to use this organization. If you want help for you as an adult, or if you are having issues with your teen, they are the people to call!",
    "name": "Ouida Dest",
    "title": "(Former) Career Prosecutor"
  },
  {
    "quote": "Three Trees is a trusted advisor who supports our team in developing a clear understanding of our strategic plan and how each team member's work connects to our organizational goals. Ben's coaching, informed by decades of experience, has helped us create a shared alignment around our vision and helps lead efforts to institute change to accomplish our mission.",
    "name": "Hospice & Community Care",
    "title": ""
  },
  {
    "quote": "Ben has helped our organization create a measurable, cohesive system for performance and leadership. I would recommend 3Trees for any organization looking for a transparent way to improve.",
    "name": "Jada Charley",
    "title": ""
  }
] 